placeholder/0_86_683_2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
6018
(
(0.01 1.0125 -0.005)
(0.01 1.0375 -0.005)
(0.01 1.0625 -0.005)
(0.01 1.0875 -0.005)
(0.01 1.1125 -0.005)
(0.01 1.1375 -0.005)
(0.01 1.1625 -0.005)
(0.01 1.1875 -0.005)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((0.01 1.5 -0.005) (0.03 1.5 -0.005) (0.05 1.5 -0.005) (0.07 1.5 -0.005) (0.09 1.5 -0.005) (0.11 1.5 -0.005) (0.13 1.5 -0.005) (0.15 1.5 -0.005) (0.17 1.5 -0.005) (0.19 1.5 -0.005));
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 10((2.81 1.5 -0.005) (2.83 1.5 -0.005) (2.85 1.5 -0.005) (2.87 1.5 -0.005) (2.89 1.5 -0.005) (2.91 1.5 -0.005) (2.93 1.5 -0.005) (2.95 1.5 -0.005) (2.97 1.5 -0.005) (2.99 1.5 -0.005));
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
423
(
(0 1.0125 -0.005)
(0 1.0375 -0.005)
(0 1.0625 -0.005)
(0 1.0875 -0.005)
(0 1.1125 -0.005)
(0 1.1375 -0.005)
(0 1.1625 -0.005)
(0 1.1875 -0.005)
...
)
;
    }
    baffle
    {
        type            calculated;
        value           nonuniform List<vector> 
71
(
(1.525 0.152647 -0.005)
(1.525 0.177941 -0.005)
(1.525 0.203235 -0.005)
(1.525 0.228529 -0.005)
(1.525 0.253824 -0.005)
(1.525 0.279118 -0.005)
(1.525 0.304412 -0.005)
(1.525 0.329706 -0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
