placeholder/0_86_683_2/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
6018
(
1.0125
1.0375
1.0625
1.0875
1.1125
1.1375
1.1625
1.1875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5 1.5);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
423
(
1.0125
1.0375
1.0625
1.0875
1.1125
1.1375
1.1625
1.1875
...
)
;
    }
    baffle
    {
        type            calculated;
        value           nonuniform List<scalar> 
71
(
0.152647
0.177941
0.203235
0.228529
0.253824
0.279118
0.304412
0.329706
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
